src/main/resources/test.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <daorudanju xmlns="http://HanThink.com/">
      <dengluming>Admin</dengluming>
      <denglumima>1CCjc7z+m3nmqvYlGnc+LcM8t4=</denglumima>
      <zhangtaoming>测试帐套</zhangtaoming>
      <danjuds>
        <xsd:schema>
        	<![CDATA[
        		 {
	"changbian" : "Test",
	"daohuoriqi" : "2014-11-1",
	"dizhi" : "Test",
	"id" : "122",
	"kehudanhao" : "test",
	"riqi" : "Test",
	"zibiaoList" : [ {
		"buhanshuidanjia" : "12333",
		"buhanshuijine" : "12333",
		"hanshuidanjia" : "12333",
		"hanshuijine" : "12333",
		"huansuanlv1" : "12333",
		"huohao" : "12333",
		"shuilv" : "12333",
		"shuliang" : "12333",
		"tiaoxingma" : "12333",
		"xiangshu" : "12333",
		"zhubiaoid" : "12333"
	} ]
}	
        	]]>
        </xsd:schema>json</danjuds>
    </daorudanju>
  </soap:Body>
</soap:Envelope>